; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	thermograph1 - mode
	thermograph0 - mode
	thermograph2 - mode
	Star1 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star2 - direction
	Star0 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument4 thermograph0)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star0)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(pointing satellite3 Planet8)
	(have_image Phenomenon5 thermograph0)
	(have_image Planet6 thermograph2)
	(have_image Planet7 thermograph0)
	(have_image Planet8 thermograph2)
	(have_image Planet9 thermograph1)
	(have_image Planet10 thermograph1)
	(have_image Star11 thermograph1)
	(have_image Star12 thermograph2)
))

)

; plan
1. (turn_to satellite1 groundstation3 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 10
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 1 of 10
4. (turn_to satellite0 planet6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet6)
   goals met: 1 of 10
5. (take_image satellite0 planet6 instrument0 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 2 of 10
6. (turn_to satellite0 planet10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet10)
   goals met: 2 of 10
7. (take_image satellite0 planet10 instrument0 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 3 of 10
8. (turn_to satellite0 phenomenon5 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 10
9. (take_image satellite0 phenomenon5 instrument0 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   goals met: 4 of 10
10. (turn_to satellite0 planet7 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet7)
   goals met: 4 of 10
11. (take_image satellite0 planet7 instrument0 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 5 of 10
12. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 5 of 10
13. (take_image satellite0 planet8 instrument0 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 6 of 10
14. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 6 of 10
15. (take_image satellite0 planet9 instrument0 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 7 of 10
16. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 7 of 10
17. (take_image satellite0 star11 instrument0 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 8 of 10
18. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 8 of 10
19. (take_image satellite0 star12 instrument0 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 9 of 10
20. (turn_to satellite3 planet8 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 planet8)
   goals met: 10 of 10
